src/Catalogs/ШаблоныТекстаРеквизитовОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныТекстаРеквизитовОбследований</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодчиненРеквизиту</Name>
					<Comment>Подчинен реквизиту обследования</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодчиненДиагнозу</Name>
					<Comment>Подчинение в разрезе диагноза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор текстового шаблона</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныТекстаРеквизитовОбследований/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Обработчик заполнения объекта внешними данными
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)	
	// Заполнение на основании структуры данных
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Родитель") И НЕ ЗначениеЗаполнено(ПодчиненРеквизиту) Тогда
			ПодчиненРеквизиту = ДанныеЗаполнения.Родитель.ПодчиненРеквизиту;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ПодчиненРеквизиту") И НЕ ЗначениеЗаполнено(ПодчиненРеквизиту) Тогда
			ПодчиненРеквизиту = ДанныеЗаполнения.ПодчиненРеквизиту;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ТекстШаблона") И НЕ ЗначениеЗаполнено(ТекстШаблона) Тогда
			ТекстШаблона = ДанныеЗаполнения.ТекстШаблона;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ПодчиненДиагнозу") И НЕ ЗначениеЗаполнено(ПодчиненДиагнозу) Тогда
			ПодчиненДиагнозу = ДанныеЗаполнения.ПодчиненДиагнозу;
		КонецЕсли;
	КонецЕсли;
	// Заполнение автора
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		 Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

// Обработчик перед записью объекта
Процедура ПередЗаписью(Отказ)	
	Если НЕ ЭтоГруппа Тогда
	     Наименование = ТекстШаблона;// ?(СтрДлина(ТекстШаблона) > 25,Лев(ТекстШаблона,20) + "...",ТекстШаблона);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
